<a href="https://colab.research.google.com/github/PandukaBandara99/Database-Engineering/blob/main/Introduction_to_Databases.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Mahela Panduka Bandara ; <br> UG @ Dpt. of Electronic & Electrical Engineering ;<br> University of Peradeniya ;<br> 2023/05 <br><br> Email : e19039@end.pdn.ac.lk <br> LinkedIN : https://www.linkedin.com/in/pandukabandara/

References : 
1. https://www.coursera.org/professional-certificates/meta-database-engineer

# 1.0 Introduction to Databases

## 1.1 Databases

Databases store and organize large amounts of information, using a variety of structures and models such as relational, NoSQL, object-oriented, hierarchical, and network.
Types of databases:
1. **Relational databases:** These databases store data in tables with rows and columns. They use a structured query language (SQL) to manage and manipulate data. Examples of relational databases include MySQL, Oracle, and PostgreSQL.

2. **NoSQL databases:** These databases use a non-relational data model, which means they don't use tables, rows, and columns. Instead, they use a variety of data models, such as document, key-value, and graph. Examples of NoSQL databases include MongoDB, Cassandra, and Redis.

3. **Object-oriented databases:** These databases are designed to work with object-oriented programming languages, such as Java and C++. They store data in objects, which are similar to the objects used in programming. Examples of object-oriented databases include db4o and ObjectDB.

4. **Hierarchical databases:** These databases organize data in a tree-like structure, with each record having one parent and possibly many children. They're often used for storing information about organizational structures or file systems. Examples of hierarchical databases include IBM's Information Management System (IMS) and the Windows Registry.

5. **Network databases:** These databases are similar to hierarchical databases, but they allow each record to have multiple parents and children, forming a network of relationships. They're often used for modeling complex relationships between entities. Examples of network databases include Integrated Data Store (IDS) and CA-IDMS.

## 1.2 Introduction To SQL

**Structured Query Language (SQL)** is a programming language used to manage and manipulate relational databases.

### 1.2.1  SQL Commands

In SQL (Structured Query Language), there are four main types of commands:

1. **Data Definition Language (DDL):** These commands are used to define the structure of the database, including creating, altering, and deleting tables and other objects. Examples include CREATE, ALTER, and DROP.

2. **Data Manipulation Language (DML):** These commands are used to manipulate data within the database, including inserting, updating, and deleting data. Examples include INSERT, UPDATE, and DELETE.

3. **Data Control Language (DCL):** These commands are used to control access to the database, including granting and revoking privileges to users and roles. Examples include GRANT and REVOKE.

4. **Transaction Control Language (TCL):** These commands are used to manage transactions, which are sets of operations that must be performed together as a single, atomic unit. Examples include COMMIT and ROLLBACK.

### 1.2.2 Tables in SQL

In a relational database, data is organized into tables. A table consists of rows and columns, with each row representing a single record and each column representing a field within that record. The structure of a table is defined by its columns, which specify the name, data type, and other characteristics of each field.

####  Common data types in SQL



1. **Numeric data types :** such as INT, DECIMAL, and FLOAT, for storing numerical data.

2. **String data types :** such as VARCHAR and CHAR, for storing character strings.

3. **Date and time data types :** such as DATE, TIME, and DATETIME, for storing date and time values.

4. **Boolean data type :** such as BOOLEAN or BIT, for storing true/false values.

5. **Binary data types :** such as BLOB and VARBINARY, for storing binary data.

6. **XML data type:** for storing XML documents.

####  Primary Key and Foreign Key



**Primary Key:**
A primary key is a column or set of columns in a table that uniquely identifies each row of data. It is used to ensure data integrity and establish relationships with other tables in the database.

> Example :- Table : Students

  | StudentID | Name    | Age | Gender | Major   |
  | --------- | ------- | --- | ------ | ------- |
  | 1         | Alice   | 21  | Female | Biology |
  | 2         | Bob     | 22  | Male   | History |
  | 3         | Charlie | 20  | Male   | English |

In this example, the "StudentID" column serves as the primary key, ensuring that each row has a unique ID number.

**Foreign Key:**
A foreign key is a column or set of columns in a table that references the primary key of another table. This establishes a relationship between the two tables, allowing data to be linked between them.

> Example :- Table : Enrollments

  | EnrollmentID | StudentID | Course   |
  | ------------ | --------- | -------- |
  | 1            | 1         | Biology 101 |
  | 2            | 2         | History 101 |
  | 3            | 3         | English 101 |
  | 4            | 1         | Chemistry 101 |

In this example, the "StudentID" column in the "Enrollments" table serves as a foreign key, referencing the primary key in the "Students" table. This allows the "Enrollments" table to link each enrollment with the corresponding student from the "Students" table.

### 1.2.3 Integrity Constraints in SQL

1. **Key Constraints:**
Key constraints are used to ensure that each row in a table can be uniquely identified by a specific column or set of columns, known as the key. In SQL, there are two types of key constraints:

  > - **Primary Key Constraint:** This is a key constraint that specifies the.primary key of a table, which must be unique for each row and cannot be NULL.
  > - **Unique Key Constraint:** This is a key constraint that specifies a unique key for a table, which must be unique for each row but can be NULL.

2. **Domain Constraints:**
Domain constraints are used to ensure that the data in a specific column of a table adheres to a specific data type or format. In SQL, there are several types of domain constraints, including:

  >  - **NOT NULL Constraint:** Ensures that a column cannot have a NULL value.
  >  - **CHECK Constraint:** Ensures that the values in a column meet a specified condition.
  >  - **DEFAULT Constraint:** Sets a default value for a column if no value is provided.

3. **Referential Integrity Constraints:**
Referential integrity constraints are used to maintain the consistency and accuracy of data between related tables. In SQL, the most common referential integrity constraint is the **foreign key constraint**, which ensures that a column in one table references a primary key in another table. If a value in the foreign key column does not match a value in the primary key column, the constraint will prevent the operation from being executed or take appropriate actions, such as cascading updates or deletes.

### 1.2.4 Constraints in mySQL


| Constraint | Description | Syntax |
| --- | --- | --- |
| PRIMARY KEY | A column or combination of columns that uniquely identifies each row in a table. The values in the column(s) must be unique and cannot be NULL. | `PRIMARY KEY (column_name)` |
| FOREIGN KEY | A column or combination of columns that refers to the primary key of another table. It ensures referential integrity between tables by requiring that the values in the foreign key column(s) must exist in the referenced table's primary key column(s). | `FOREIGN KEY (column_name) REFERENCES table_name(primary_key_column_name)` |
| UNIQUE | A constraint that ensures that the values in a column or combination of columns are unique, but allows NULL values. | `UNIQUE (column_name)` |
| NOT NULL | A constraint that ensures that a column cannot have NULL values. | `column_name data_type NOT NULL` |
| CHECK | A constraint that specifies a condition that must be true for the row to be inserted or updated. | `CHECK (condition)` |
| DEFAULT | A constraint that sets a default value for a column if no value is specified. | `column_name data_type DEFAULT default_value` |
| INDEX | A data structure that improves the speed of data retrieval operations on a table by allowing quick access to specific rows. | `INDEX (column_name)` or `INDEX index_name (column_name)` |
| FULLTEXT | An index type that enables full-text searches for words and phrases in a text column. | `FULLTEXT (column_name)` |
| UNIQUE INDEX | A combination of the unique and index constraints, it ensures that the values in a column or combination of columns are unique and creates an index for faster data retrieval. | `UNIQUE INDEX (column_name)` or `UNIQUE INDEX index_name (column_name)` |
| PRIMARY KEY INDEX | A combination of the primary key and index constraints, it creates an index for faster data retrieval and ensures that the values in a column or combination of columns are unique and cannot be NULL. | `PRIMARY KEY INDEX (column_name)` or `PRIMARY KEY INDEX index_name (column_name)` |
| FOREIGN KEY INDEX | A combination of the foreign key and index constraints, it creates an index for faster data retrieval and ensures referential integrity between tables by requiring that the values in the foreign key column(s) must exist in the referenced table's primary key column(s). | `FOREIGN KEY INDEX (column_name) REFERENCES table_name(primary_key_column_name)` or `FOREIGN KEY INDEX index_name (column_name) REFERENCES table_name(primary_key_column_name)` |



Examples :

```sql
CREATE TABLE customers (
   customer_id INT NOT NULL PRIMARY KEY,
   first_name VARCHAR(50) NOT NULL,
   last_name VARCHAR(50) NOT NULL,
   email VARCHAR(50) UNIQUE,
   address VARCHAR(100),
   phone_number VARCHAR(20),
   age INT CHECK (age >= 18),
   registration_date DATE DEFAULT CURDATE(),
   INDEX (last_name)
);

CREATE TABLE orders (
   order_id INT NOT NULL PRIMARY KEY,
   customer_id INT NOT NULL,
   order_date DATE NOT NULL,
   total_price DECIMAL(10,2) NOT NULL,
   FOREIGN KEY (customer_id) REFERENCES customers(customer_id),
   INDEX (order_date)
);
```

When using multiple constraints in SQL:

1. **Choose the right constraint for the job:** There are several types of constraints available in SQL, such as primary key, unique, foreign key, and check constraints. Each has a specific purpose and should be used appropriately. For example, use a primary key constraint to ensure a unique identifier for a table, use a foreign key constraint to enforce referential integrity between tables, and use a check constraint to validate data based on a specific condition.

2. **Keep constraints simple:** While it is possible to combine multiple constraints in SQL, it's important to keep them as simple as possible to ensure that they are easy to understand and maintain. This means avoiding overly complex constraints that are difficult to read or modify, and sticking to simple combinations of basic constraints, such as NOT NULL and UNIQUE.

3. **Consider performance implications:** When using multiple constraints in SQL, it's important to consider the potential performance implications. Constraints can slow down queries and other operations, particularly when working with large datasets. It's important to test constraints thoroughly to ensure that they are not having a negative impact on performance.

4. **Use appropriate indexing:** To help improve performance when using multiple constraints in SQL, it's important to use appropriate indexing. Indexes can help to speed up queries and other operations by allowing the database to quickly locate specific data. Consider creating indexes on columns that are frequently used in constraints to improve query performance.

5. **Test thoroughly:** Finally, when using multiple constraints in SQL, it's important to test them thoroughly to ensure that they are working as intended. This means testing constraints in a variety of scenarios, such as inserting, updating, and deleting data, to ensure that they are enforcing data integrity correctly. Regular testing can help to identify issues and ensure that constraints remain effective and efficient over time.

## 1.3 SQL Data Types

### 1.3.1 Numerical Data



| Data Type | Description | Range of Values | Storage Size | Applicable Keywords |
| --- | --- | --- | --- | --- |
| TINYINT | A very small integer | -128 to 127 (signed) or 0 to 255 (unsigned) | 1 byte | TINYINT, TINYINT(n), BOOLEAN |
| SMALLINT | A small integer | -32,768 to 32,767 (signed) or 0 to 65,535 (unsigned) | 2 bytes | SMALLINT, SMALLINT(n), INT2 |
| MEDIUMINT | A medium-sized integer | -8,388,608 to 8,388,607 (signed) or 0 to 16,777,215 (unsigned) | 3 bytes | MEDIUMINT, MEDIUMINT(n) |
| INT or INTEGER | A standard integer | -2,147,483,648 to 2,147,483,647 (signed) or 0 to 4,294,967,295 (unsigned) | 4 bytes | INT, INTEGER, INT4 |
| BIGINT | A large integer | -9,223,372,036,854,775,808 to 9,223,372,036,854,775,807 (signed) or 0 to 18,446,744,073,709,551,615 (unsigned) | 8 bytes | BIGINT, BIGINT(n), INT8 |
| FLOAT | A single-precision floating-point number | -3.40282347E+38 to -1.17549435E-38, 0, and 1.17549435E-38 to 3.40282347E+38 | 4 bytes | FLOAT(p) |
| DOUBLE or REAL | A double-precision floating-point number | -1.7976931348623157E+308 to -2.2250738585072014E-308, 0, and 2.2250738585072014E-308 to 1.7976931348623157E+308 | 8 bytes | DOUBLE, DOUBLE PRECISION, REAL(p) |
| DECIMAL or NUMERIC | A fixed-point decimal number | -10^38 +1 to 10^38 -1 | Varies (up to 65 bytes) | DECIMAL(p,s), NUMERIC(p,s) |

Note that the `(n)` and `(p,s)` in the Applicable Keywords column indicate that can specify a custom length or precision and scale, respectively, for the data type. The actual range of values and storage size may depend on the specific length or precision and scale you specify.

### 1.3.2 String Data types



| Data Type | Description | Maximum Length | Applicable Keywords |
| --- | --- | --- | --- |
| CHAR | A fixed-length character string | Up to 255 characters | CHAR(n) |
| VARCHAR | A variable-length character string | Up to 65,535 characters | VARCHAR(n) |
| TINYTEXT | A small variable-length text string | Up to 255 characters | TINYTEXT |
| TEXT | A medium-sized variable-length text string | Up to 65,535 characters | TEXT |
| MEDIUMTEXT | A large variable-length text string | Up to 16,777,215 characters | MEDIUMTEXT |
| LONGTEXT | A very large variable-length text string | Up to 4,294,967,295 characters | LONGTEXT |
| BINARY | A fixed-length binary string | Up to 255 bytes | BINARY(n) |
| VARBINARY | A variable-length binary string | Up to 65,535 bytes | VARBINARY(n) |
| TINYBLOB | A small variable-length binary string | Up to 255 bytes | TINYBLOB |
| BLOB | A medium-sized variable-length binary string | Up to 65,535 bytes | BLOB |
| MEDIUMBLOB | A large variable-length binary string | Up to 16,777,215 bytes | MEDIUMBLOB |
| LONGBLOB | A very large variable-length binary string | Up to 4,294,967,295 bytes | LONGBLOB |

Note that the `(n)` in the Applicable Keywords column indicate that  can specify a custom length for the data type. The actual maximum length may depend on the specific length you specify.

### 1.3.3. Special Data Types



| Data Type | Description |
| --------- | ----------- |
| DATE | Stores a date in the format YYYY-MM-DD |
| TIME | Stores a time in the format HH:MM:SS |
| DATETIME | Stores both a date and a time in the format YYYY-MM-DD HH:MM:SS |
| TIMESTAMP | Stores both a date and a time in the format YYYY-MM-DD HH:MM:SS, with a range from 1970-01-01 00:00:01 to 2038-01-19 03:14:07 (in UTC) |
| YEAR | Stores a year in two-digit or four-digit format (e.g. 1998 or 98) |
| CHAR | Stores a fixed-length string of up to 255 characters |
| VARCHAR | Stores a variable-length string of up to 65,535 characters |
| TEXT | Stores a variable-length string of up to 65,535 characters (longer than VARCHAR) |
| BLOB | Stores binary data of up to 65,535 bytes |
| ENUM | Stores a list of up to 65,535 values, each of which must be a string or a numeric value |
| SET | Stores a set of up to 64 different values, each of which must be a string or a numeric value |

## 1.4 Syntax

### 1.4.1 Creating a Database

To create a database in MySQL :

>  ```sql
>  CREATE DATABASE database_name;
>  ```


It's important to note that need to have the proper permissions to create a database. Use the `USE` command to start working with it:

>  ```sql
>  USE mydatabase;
>  ```

This command tells MySQL to use the "mydatabase" database for any subsequent commands until you switch to another database or exit MySQL.

### 1.4.2 Create Tables

To create a table in MySQL:

```sql
CREATE TABLE table_name (
   column1 datatype,
   column2 datatype,
   column3 datatype,
   .....
);
```

### 1.4.3 View The Tables

To view the tables:

>  ```sql
>  SHOW TABLES;
>  ```

This command will return a list of all the tables in the currently selected database. 
For example, if you want to view the tables in a database named "mydatabase", you would use the following commands:

To view the columns of a table in MySQL:

>  ```sql
>  SHOW COLUMNS FROM table_name;
>  ```

To see more information about a specific table, can use the `DESCRIBE` or `EXPLAIN` command followed by the name of the table:

>  ```sql
>  DESCRIBE table_name;
>  ```

This command will show you the structure of the specified table, including the names and data types of the columns. 

Using the  `DESCRIBE` command to view the structure of a table, which includes information about the columns as well as any indexes, keys, or constraints that have been defined for the table:

>  ```sql
>  DESCRIBE table_name;
>  ```

This will show you the same information as the `SHOW COLUMNS` command, as well as any additional information about the table's structure.

### 1.4.4 Default Values in mySQL



In MySQL, default values are used to provide a predefined value for a column if no value is explicitly specified during the insertion of a new row into the table. Default values are also used when a column is added to an existing table and the column needs to be assigned a default value for all existing rows.

Some important things to know about default values in MySQL:

1. Default values can be assigned to any column in a table, except for columns that are part of the PRIMARY KEY or a UNIQUE constraint.

2. The default value can be specified at the time of table creation, or when a new column is added to an existing table using the ALTER TABLE statement.

3. The default value can be a literal value such as a string, number, or date, or it can be a system function that generates a value such as CURRENT_TIMESTAMP.

4. If a column with a default value is not included in the INSERT statement, MySQL will automatically insert the default value into the column.

5. If a column with a default value is included in the INSERT statement with a NULL value, MySQL will insert the default value into the column instead of the NULL value.

6. When a default value is assigned to a column, it is stored in the table definition and not with individual rows of data.

7. If a default value is changed using ALTER TABLE, the new default value will only apply to new rows added to the table. Existing rows will retain their original default value.

8. Default values can be overridden by explicitly specifying a value for the column in the INSERT statement.

9. If a default value is assigned to a column and the column is subsequently dropped from the table, the default value is also removed from the table definition.



In MySQL, 

1. **Specifying default values when creating a new table:**

When creating a new table, can specify default values for columns using the DEFAULT keyword followed by the value want to set as the default. 

>  ```sql
>  CREATE TABLE my_table (
>     id INT NOT NULL,
>     name VARCHAR(50) DEFAULT 'John',
>     age INT DEFAULT 30
>  );
>  ```


2. **Specifying default values when adding a new column to an existing table:**

>  When adding a new column to an existing table, can specify the default value using the ALTER TABLE statement.
>
>  ```sql
>  ALTER TABLE my_table ADD COLUMN address VARCHAR(100) DEFAULT 'Unknown';
>  ```

3. **To modify the default value of an existing column** using ALTER TABLE with the MODIFY COLUMN option.

>  ```sql
>  ALTER TABLE my_table MODIFY COLUMN age INT DEFAULT 35;
>  ```
>
>  Note that default values can be specified for any column type **except for the BLOB, TEXT, and JSON data types**. Additionally, the DEFAULT keyword is not used when specifying default values for **ENUM and SET columns**. Instead, the default value is specified as one of the values in the ENUM or SET list.

### 1.4.5 Inserting Data

 `INSERT INTO` statement syntax:

1. **Inserting a single row of data with specific values**

>  ```sql
>  INSERT INTO table_name (column1, column2, column3) 
>  VALUES (value1, value2, value3);
>  ```

2. **Inserting multiple rows of data with specific values**

>  ```sql
>  INSERT INTO table_name (column1, column2, column3) 
>  VALUES (value1, value2, value3), 
>         (value4, value5, value6), 
>         (value7, value8, value9);
>  ```

3. **Inserting a single row of data with default values**

>  ```sql
>  INSERT INTO table_name DEFAULT VALUES;
>  ```
>
>  This syntax allows you to insert a single row of data into a table with default values for all columns. If you have specified default values for the columns in the table definition, they will be used. Otherwise, the default value for each column type will be used.

4. **Inserting data from another table**

>  ```sql
>  INSERT INTO table_name (column1, column2, column3)  
>  SELECT column1, column2, column3 FROM other_table WHERE condition;
>  ```

### 1.4.6 Select From

To select data from a MySQL table, can use the `SELECT` statement

1. **Selecting all columns from a table**

>  ```sql
>  SELECT * FROM table_name;
>  ```
>
>  In this syntax, the `*` character is used to select all columns from the specified table.

2. **Selecting specific columns from a table**

>  ```sql
>  SELECT column1, column2, column3 FROM table_name;
>  ```
>
>  This syntax allows to select specific columns from the specified table by listing them after the `SELECT` keyword, separated by commas.

3. **Selecting distinct values from a column**

>  ```sql
>  SELECT DISTINCT column1 FROM table_name;
>  ```
>
>  This syntax allows to select only the unique values from a column in the specified table.

4. **Filtering rows with a WHERE clause**

>  ```sql
>  SELECT column1, column2 FROM table_name WHERE condition;
>  ```
>
>  This syntax allows to select specific columns from the specified table and filter the rows based on a condition specified in the `WHERE` clause. The condition can be a comparison, such as `column1 = 'value'`, or a logical operator, such as `column2 > 10 AND column3 < 20`.

5. **Limiting the number of rows with a LIMIT clause**

>  ```sql
>  SELECT column1, column2 FROM table_name LIMIT 10;
>  ```
>
> This syntax allows to limit the number of rows returned by the `SELECT` statement. The `LIMIT` keyword is used to specify the maximum number of rows to return.

### 1.4.7 Update

UPDATE is used to modify data in a table. 

>  ```sql
>  UPDATE table_name SET column_name = new_value WHERE condition;
>  ```
>
> - `table_name`: The name of the table that you want to modify.
> - `column_name`: The name of the column that you want to update.
> - `new_value`: The new value that you want to set for the column.
> - `condition`: The condition that specifies which rows to update.


To update multiple columns in a single UPDATE statement by separating each column with a comma:

>  ```sql
>  UPDATE users SET age = 30, email = 'new_email@example.com' WHERE id = 1;
>  ```

This will modify the age and email columns of the user with id 1.

To update all the rows in a table:

>  ```sql
>  UPDATE table_name SET column_name = new_value;
>  ```

This will update all the rows in the table with the new value for the specified column.

### 1.4.8 Delete

MySQL DELETE is a command used to delete one or more **rows** from a table.

>  ```sql
>  DELETE FROM table_name WHERE condition;
>  ```
> 
>  - `table_name`: The name of the table from which you want to delete rows.
>  - `condition`: The condition that specifies which rows to delete.


To delete all the rows in a table:

>  ```sql
>  DELETE FROM table_name;
>  ```

In addition , 
> ```sql
> TRUNCATE TABLE table_name;
> ```
can be used to delete all the entries from a table

### 1.4.9 Alter Table (Change table structure)

MySQL ALTER TABLE is a command used to modify the structure of an existing table. It can be used to add, delete, or modify columns, change data types, add or drop constraints, and rename tables. The ALTER TABLE statement can also be used to optimize the table, change the engine type, and set table-level options.

The syntax for the ALTER TABLE statement is as follows:

>  ```sql
>  ALTER TABLE table_name action;
>  ```
>  
>  - `table_name`: The name of the table that you want to modify.
>  - `action`: The action that you want to perform on the table.

Some actions that can be performed using ALTER TABLE:

1. **Add a new column:**

>  ```sql
>  ALTER TABLE table_name ADD column_name datatype;
>  ```

2. **Delete a column:**

>  ```sql
>  ALTER TABLE table_name DROP COLUMN column_name;
>  ```

3. **Modify a column:**

>  ```sql
>  ALTER TABLE table_name MODIFY column_name new_datatype;
>  ```

4. **Rename a table:**

>  ```sql
>  ALTER TABLE old_table_name RENAME TO new_table_name;
>  ```

5. **Change the table engine:**

>  ```sql
>  ALTER TABLE table_name ENGINE = InnoDB;
>  ```

6. **Add a primary key:**

>  ```sql
>  ALTER TABLE table_name ADD PRIMARY KEY (column_name);
>  ```

7. **Add a foreign key:**

>  ```sql
>  ALTER TABLE table_name ADD CONSTRAINT fk_name FOREIGN KEY (column_name) REFERENCES other_table(column_name);
>  ```

8. **Remove a constraint:**

>  ```sql
>  ALTER TABLE table_name DROP CONSTRAINT constraint_name;
>  ```

It is important to note that altering a table can be a time-consuming operation, particularly for large tables. Therefore, it is recommended to perform ALTER TABLE statements during off-peak hours when there is less activity on the database.

Also, make sure to backup  data before performing any modifications to a table. Incorrect use of the ALTER TABLE statement can cause data loss or corruption, so it's important to test any changes in a non-production environment before applying them to  production database.

### 1.4.10 SQL Operators



1. **Arithmetic operators**

| Operator | Description                | Example                    |
|----------|----------------------------|----------------------------|
| +        | Addition                   | `SELECT 5 + 3;`             |
| -        | Subtraction                | `SELECT 5 - 3;`             |
| *        | Multiplication             | `SELECT 5 * 3;`             |
| /        | Division                   | `SELECT 5 / 3;`             |
| %        | Modulo (remainder of div.) | `SELECT 5 % 3;`             |

2. **Comparison operators**

| Operator | Description                | Example                          |
|----------|----------------------------|----------------------------------|
| =        | Equal to                   | `SELECT * FROM employees WHERE age = 30;` |
| <>       | Not equal to               | `SELECT * FROM employees WHERE department <> 'sales';` |
| <        | Less than                  | `SELECT * FROM products WHERE price < 10;` |
| >        | Greater than               | `SELECT * FROM products WHERE price > 50;` |
| <=       | Less than or equal to      | `SELECT * FROM products WHERE price <= 10;` |
| >=       | Greater than or equal to   | `SELECT * FROM products WHERE price >= 50;` |

3. **Logical operators**

| Operator | Description                | Example                                                    |
|----------|----------------------------|------------------------------------------------------------|
| AND      | Logical AND                | `SELECT * FROM employees WHERE age > 30 AND salary > 50000;` |
| OR       | Logical OR                 | `SELECT * FROM employees WHERE age > 30 OR salary > 50000;`  |
| NOT      | Logical NOT                | `SELECT * FROM employees WHERE NOT age > 30;`               |

4. **Bitwise operators**

| Operator | Description                | Example                                      |
|----------|----------------------------|----------------------------------------------|
| &        | Bitwise AND                | `SELECT 5 & 3;`                               |
| \|       | Bitwise OR                 | `SELECT 5 \| 3;`                              |
| ^        | Bitwise XOR                | `SELECT 5 ^ 3;`                               |
| ~        | Bitwise NOT                | `SELECT ~5;`                                  |
| <<       | Bitwise left shift         | `SELECT 5 << 1;`                              |
| >>       | Bitwise right shift        | `SELECT 5 >> 1;`                              |

### 1.4.11 Where clause

The WHERE clause in MySQL is used to filter rows from a table based on a specified condition. It allows to specify one or more conditions that must be met for a row to be included in the result set of a SELECT statement.

**Syntax:**
The basic syntax of the WHERE clause is as follows:

>  ```sql
>  SELECT column1, column2, ...
>  FROM table_name
>  WHERE condition;
>  ```
>
>  Where:
>  - `column1`, `column2`, ... are the columns to retrieve data from.
>  - `table_name` is the name of the table from which to retrieve data.
>  - `condition` is a logical expression that evaluates to either true or false.

**Operators used in WHERE clause:**

- `=` : Equal to
- `!=` or `<>` : Not equal to
- `>` : Greater than
- `<` : Less than
- `>=` : Greater than or equal to
- `<=` : Less than or equal to
- `LIKE` : Pattern matching
- `IN` : Matches any value in a list
- `BETWEEN` : Matches any value within a range
- `IS NULL` : Matches any NULL value

**Examples:**

1. **Retrieve data based on a single condition:**
>  ```sql
>  SELECT * FROM table1
>  WHERE column1 = 'value';
>  ```
>
>  This will retrieve all rows from the `table1` table where `column1` is equal to `'value'`.

2. **Retrieve data based on multiple conditions:**
>  ```sql
>  SELECT * FROM table1
>  WHERE column1 = 'value1' AND column2 = 'value2';
>  ```
>
>  This will retrieve all rows from the `table1` table where `column1` is equal to `'value1'` and `column2` is equal to `'value2'`.

3. **Retrieve data using the LIKE operator:**
>  ```sql
>  SELECT * FROM table1
>  WHERE column1 LIKE 'value%';
>  ```
>
>  This will retrieve all rows from the `table1` table where `column1` starts with the word `'value'`.

4. **Retrieve data using the IN operator:**
>  ```sql
>  SELECT * FROM table1
>  WHERE column1 IN ('value1', 'value2', 'value3');
>  ```
>
>  This will retrieve all rows from the `table1` table where `column1` matches any value in the list of `'value1'`, `'value2'`, and `'value3'`.

5. **Retrieve data using the BETWEEN operator:**
>  ```sql
>  SELECT * FROM table1
>  WHERE column1 BETWEEN 10 AND 20;
>  ```
>
>  This will retrieve all rows from the `table1` table where `column1` matches any value within the range of `10` and `20`.

6. **Retrieve data using the IS NULL operator:**
>  ```sql
>  SELECT * FROM table1
>  WHERE column1 IS NULL;
>  ```
>
>  This will retrieve all rows from the `table1` table where `column1` matches any NULL value.

### 1.4.12 Select Distinct

`SELECT DISTINCT` statement in MySQL:

The `SELECT DISTINCT` statement in MySQL is used to retrieve unique values from a specific column or a combination of columns in a table. It eliminates duplicates and returns only the distinct values.

**Syntax:**
The basic syntax of the `SELECT DISTINCT` statement is as follows:

>  ```sql
>  SELECT DISTINCT column1, column2, ...
>  FROM table_name;
>  ```
>
>  Where:
>  - `column1`, `column2`, ... are the columns to retrieve unique values from.
>  - `table_name` is the name of the table from which to retrieve data.

**Example:**

Consider the following `table1`:

>  ```
>  id | name | age
>  ---|------|----
>  1  | John | 25
>  2  | Jane | 30
>  3  | John | 25
>  4  | Mary | 35
>  ```

To retrieve the distinct values of the `name` column, 

>  ```sql
>  SELECT DISTINCT name
>  FROM table1;
>  ```

This will return the following result:

>  ```
>  name
>  ----
>  John
>  Jane
>  Mary
>  ```

To retrieve the distinct values of a combination of columns, 

>  ```sql
>  SELECT DISTINCT name, age
>  FROM table1;
>  ```

This will return the following result:

>  ```
>  name | age
>  -----|----
>  John | 25
>  Jane | 30
>  Mary | 35
>  ```

It is important to note that the `SELECT DISTINCT` statement is slower than the regular `SELECT` statement because it needs to compare each row with all previous rows to eliminate duplicates. Therefore, it is recommended to use it only when necessary.

### 1.4.13 Sorting Data

The `ORDER BY` clause is used in MySQL to sort the result set of a SELECT statement. It allows you to specify one or more columns to sort by and the order in which they should be sorted. 

Syntax:
The basic syntax of the ORDER BY clause is as follows:

>  ```sql
>  SELECT column1, column2, ...
>  FROM table_name
>  ORDER BY column1, column2, ... ASC|DESC;
>  ```
>
> Where:
> - `column1`, `column2`, ... are the columns to sort by.
> - `table_name` is the name of the table from which to retrieve data.
> - `ASC` or `DESC` specifies the order in which to sort the data. `ASC` is the default and sorts the data in ascending order, while `DESC` sorts the data in descending order.

Examples:

1. **Sort data in ascending order:**
>  ```sql
>  SELECT * FROM table1
>  ORDER BY column1;
>  ```
>
> This will sort the data in the `table1` table by the values in `column1` in ascending order.

2. **Sort data in descending order:**
>  ```sql
>  SELECT * FROM table1
>  ORDER BY column1 DESC;
>  ```
>
>  This will sort the data in the `table1` table by the values in `column1` in descending order.

3. **Sort data by multiple columns:**
>  ```sql
>  SELECT * FROM table1
>  ORDER BY column1, column2 DESC;
>  ```
>
>  This will sort the data in the `table1` table first by the values in `column1` in ascending order, and then by the values in `column2` in descending order.

It is important to note that the ORDER BY clause should be the last clause in a SELECT statement. Any clauses that come after the ORDER BY clause, such as the LIMIT clause, will be applied after the data has been sorted.

##1.5 Database Schema

### 1.5.1 Introduction

The database schema in MySQL is a structure that defines the logical and physical layout of a database. It consists of the database objects such as tables, views, indexes, and stored procedures, and their relationships with each other.

MySQL is a relational database management system (RDBMS), which means that it organizes data in tables with defined relationships between them. Each table consists of rows and columns, where rows represent individual records and columns represent the data attributes or fields of the records.

**Tables:**
Tables are the most important part of the database schema in MySQL. They store data in a structured manner and are organized based on relationships between their columns. Each table has a unique name and a set of columns that define the data type and properties of the data in each column.

**Indexes:**
Indexes are used to improve the performance of queries on large tables by providing a faster way to retrieve data. They are created on one or more columns of a table and help to optimize the search process by allowing the database to quickly locate the data without scanning the entire table.

**Views:**
Views are virtual tables that are created based on the results of a SELECT statement. They are used to simplify complex queries and provide an abstraction layer between the user and the underlying data in the database. Views do not store data, but rather provide a way to access the data in a more user-friendly manner.

**Stored Procedures:**
Stored Procedures are a set of SQL statements that are stored in the database and can be executed as a single unit. They are used to automate tasks, improve performance, and provide security by allowing users to access the data without directly accessing the tables.

**Relationships:**
Relationships define the association between two or more tables in the database schema. There are three types of relationships: one-to-one, one-to-many, and many-to-many. They are established using primary and foreign keys, which are unique identifiers that link the tables together.

**Normalization:**
Normalization is the process of organizing the database schema to reduce redundancy and improve data consistency. It involves dividing the database into smaller, more manageable tables and establishing relationships between them.

### 1.5.2 References

In MySQL, `REFERENCES` is a keyword used to define a `foreign key` constraint. A `foreign key` constraint is a rule that specifies that the values in a column (or a group of columns) of one table must match the values in a column (or a group of columns) of another table. The table that contains the foreign key is called the child table, and the table that is referenced is called the parent table.

**The syntax** 

>  ```sql
>  CREATE TABLE child_table (
>    column1 datatype,
>    column2 datatype,
>    ...
>    FOREIGN KEY (column_name) REFERENCES parent_table (column_name)
>  );
>  ```

Here, `child_table` is the name of the child table, `column1`, `column2`, etc. are the names of the columns in the child table, and `column_name` is the name of the column in both the child and parent tables that are being matched.

**Example**

>  ```sql
>  CREATE TABLE orders (
>    order_id INT PRIMARY KEY,
>    customer_id INT,
>    order_date DATE,
>    FOREIGN KEY (customer_id) REFERENCES customers(customer_id)
>  );
> 
>  CREATE TABLE customers (
>    customer_id INT PRIMARY KEY,
>    first_name VARCHAR(50),
>    last_name VARCHAR(50),
>    email VARCHAR(50)
>  );
>  ```

In this example, there are two tables, `orders` and `customers`. The `orders` table has a foreign key constraint on the `customer_id` column that references the `customer_id` column in the `customers` table. This ensures that any value inserted into the `customer_id` column in the `orders` table must match a value in the `customer_id` column of the `customers` table.

Using REFERENCES in MySQL **ensures data integrity by preventing data from being inserted into the child table if the corresponding value does not exist in the parent table**. It also provides a way to enforce business rules and constraints in the database.

#### 1.5.2.1 Example For references

Two tables, `students` and `courses`, that have a many-to-many relationship. A student can be enrolled in multiple courses, and each course can have multiple students enrolled in it. To represent this relationship, create a third table called `enrollments` that has foreign keys that reference both the `students` and `courses` tables.

>  ```sql
> CREATE TABLE students (
>   student_id INT PRIMARY KEY,
>   first_name VARCHAR(50),
>   last_name VARCHAR(50),
>   email VARCHAR(50)
> );
>
> CREATE TABLE courses (
>   course_id INT PRIMARY KEY,
>   course_name VARCHAR(50),
>   instructor VARCHAR(50)
> );
>
> CREATE TABLE enrollments (
>   enrollment_id INT PRIMARY KEY,
>   student_id INT,
>   course_id INT,
>   enrollment_date DATE,
>   FOREIGN KEY (student_id) REFERENCES students(student_id),
>   FOREIGN KEY (course_id) REFERENCES courses(course_id)
> );
> ```

In this example, create the `students` and `courses` tables with their respective columns, and then create the `enrollments` table with a foreign key constraint on the `student_id` column that references the `student_id` column in the `students` table, and a foreign key constraint on the `course_id` column that references the `course_id` column in the `courses` table.

Now, to insert data into the `enrollments` table, must ensure that the `student_id` and `course_id` values exist in their respective parent tables.

For example:

>  ```sql
>  INSERT INTO enrollments (enrollment_id, student_id, course_id, enrollment_date) VALUES (1, 123, 456, '2023-05-12');
>  ```

This insert statement will fail if the `student_id` or `course_id` value does not exist in their respective parent tables.